---
title: 高级报刊使用指南
date: 2026-08-05
tags:
  - 关于
  - 指南
  - 上手
---

#高级报刊使用指南 

**By Polya** · August 5th


> ✨文章摘要（AI生成）
>
<!-- DESC SEP -->
>
笔者分享了一个简明的网站使用指南，包括投稿发布的流程，到本站的高阶玩法
>
<!-- DESC SEP -->


##本站致力于收集优质的出行日志！

你可能听过几家和我们重名的报社，But we are the top!(Cause traveldaily.top)

本站基于Github Action工作流自动部署
你可以提交中/英文内容，网站会自动生成翻译版本，你可以随时编辑原文与翻译版本具体食用请参考[快速开始]

##基础用法

目前网站主要是我本人的闲篇絮语，在此抛砖引玉。如果你不想看到只有我的烂文章浪费了网站资源，欢迎你的加入！

另外本站保留了大部分这个网站框架的开发者留下来的技术文章，有兴趣的可以阅读

- **[Updated daily](en/posts)**: 浏览最新文章；
- **[archive](en/archive)**: 期刊目录

##进阶

这个问题已经在[初级指南：快速开始]（/about#%E5%A6%82%E4%BD%95%E9%A3%9F%E7%94%A8)部分提及了，下面是更详细的说明：

###1.去投稿

  由于本站的工作流是基于Github部署的，作为其实际后端。这意味着你需要有一个**Github账号**，先登录[github](https://github.com)
然后回到本站，点击首页右上角[Release](/)，这会跳转到我们的投稿专属仓库。在你面前会出现一个示例文章，里面写好了投稿格式，并注释了你
会用的到的基础md语法。你在编辑完成后点击右上角Commit changes,投稿就完成了。然后到我们审核了，审核通过后你的文章会提交到我们官网的正式仓库中
（https://github.com/dongPolya/Traveldaily），网站上就会同步更新

- **关于争议：部分读者可能会觉得比较麻烦，但为了保证完整专业的流程，最终认为Github是一个更好的选择，而且很方便。后续会集成功能更强大，编辑更容易的
富文本编辑器** –

###2.获取编辑权限

   你可以在文章发布后编辑你的文章，这需要申请作者权限。点击文章下方编辑文章，来到github界面
选择文章作者（非开发者），验证你的身份，再跳转到投稿仓库，编辑完成后重新提交文章即可。

- **[Release](/about)**: 发表文章；
- **[Edit](/about)**：编辑文章，支持Markdown与html编辑，富文本编辑器正在开发测试中....

##高级用法

- **[AI automatic](/)**: Ai辅助翻译、校准、单词注释与归档、索引；
- **[Community](https://fbll.asia)**: 加入创作者社区；
- **[周刊模板](https://fav0.com)**：提供个性化模板，追求高级；
- **[评论互动](https://giscus.app/zh-CN#repository)** 为保证更多功能的评论，我们使用Giscus作为评论组件；

## 黑魔法

  本网站是整合了多个Github上的优质开源项目作为前端模板，沿袭并改进了github工作流。这些优秀的开源项目也使用github来部署
我们一并保留了它们的yml文件和一些skill等待开垦。很多用法很有创意，但笔者水平有限，还没有完全究尽。如果你感兴趣，本站存有
大量前开发者技术文章，这其中也透露了不少的开发过程，感兴趣的朋友可以查阅探索🧐

最后：**祝你使用愉快。**

> 本文涉及的所有信息，你都可以通过我们github项目中的README.md及SKILL.md等说明文件找到详细来源。

友情报社：

[预言家日报]（https://www.yyjrb.cn/）:魔法部官方专刊
[唱唱反调]（https://www.harrypotter.com/discover/books）：追求新奇事物…
[周末不迷茫]（https://fbll.asia/post/50）：优质新闻资讯聚合期刊


